import TitleAndBody from "../ui/TitleAndBody";

const SecondSection = () => {
  return (
    <div className=" mx-10 py-10" style={{ direction: "rtl" }}>
      <div className="text-center">
        <p className=" text-secondary font-semibold font-header text-2xl">
          خدمات تطوير تطبيقات الهاتف المحمول المتطورة لدينا
        </p>
        <p className="text-gray-500  font-body mt-2 text-lg ">
          نساعد رواد الأعمال على تنفيذ أفكارهم الإبداعية وتحويلها إلى تطبيقات
          جوال احترافية لكل من أنظمة أندرويد و ios‼️..
        </p>
      </div>
      <div className="grid grid-flow-row grid-cols-1 md:grid-cols-3 mt-12 gap-y-8 md:gap-y-0">
        <TitleAndBody
          title="تطبيقات المتاجر الإلكترونية"
          body="تطبيق المتجر عبر الإنترنت، المعروف أيضًا باسم تطبيق التجارة الإلكترونية،
        هو عبارة عن منصة رقمية تسمح للشركات ببيع المنتجات أو الخدمات عبر
        الإنترنت. يوفر واجهة متجر افتراضية حيث يمكن للعملاء تصفح العناصر
        واختيارها وشرائها بسهولة من أي مكان باستخدام جهاز كمبيوتر أو جهاز محمول
        متصل بالإنترنت. في شركة Sii media، نحن متخصصون في إنشاء تطبيقات متجر عبر
        الإنترنت مخصصة وقابلة للتطوير ومصممة خصيصًا لتلبية الاحتياجات الفريدة
        لعملك. يتعاون فريقنا من المطورين والمصممين ذوي الخبرة بشكل وثيق مع
        العملاء لتقديم حلول قوية للتجارة الإلكترونية تعمل على زيادة المبيعات
        وتعزيز تجارب المستخدم."
        />{" "}
        <TitleAndBody
          title="تطبيق المتجر الإلكتروني متعدد التجار"
          body="تطبيق المتجر عبر الإنترنت، المعروف أيضًا باسم تطبيق التجارة الإلكترونية،
      هو عبارة عن منصة رقمية تسمح للشركات ببيع المنتجات أو الخدمات عبر
      الإنترنت. يوفر واجهة متجر افتراضية حيث يمكن للعملاء تصفح العناصر
      واختيارها وشرائها بسهولة من أي مكان باستخدام جهاز كمبيوتر أو جهاز محمول
      متصل بالإنترنت. في شركة Sii media، نحن متخصصون في إنشاء تطبيقات متجر عبر
      الإنترنت مخصصة وقابلة للتطوير ومصممة خصيصًا لتلبية الاحتياجات الفريدة
      لعملك. يتعاون فريقنا من المطورين والمصممين ذوي الخبرة بشكل وثيق مع
      العملاء لتقديم حلول قوية للتجارة الإلكترونية تعمل على زيادة المبيعات
      وتعزيز تجارب المستخدم."
        />
        <TitleAndBody
          title="تطبيقات الوساطة التجارية"
          body="تطبيق الوساطة التجارية هو عبارة عن منصة متخصصة عبر الإنترنت تسهل المعاملات والتفاعلات بين الشركات (مقدمي الخدمات أو البائعين) والعملاء (المستهلكين أو العملاء) في مختلف الصناعات. يعمل هذا النوع من التطبيقات كوسيط، حيث يربط الشركات التي تقدم خدمات أو منتجات مع العملاء المحتملين الذين يتطلعون إلى الاستفادة من تلك الخدمات أو شراء تلك المنتجات.
            في Sii Media، نحن متخصصون في تطوير تطبيقات الوساطة التجارية المتطورة التي تمكن الشركات من تقديم خدمات الحجز والطلب عبر الإنترنت المشابهة للمنصات الشهيرة مثل Booking و Talabat. يعمل فريق الخبراء لدينا من المطورين والمصممين بشكل وثيق مع العملاء لإنشاء حلول قابلة للتخصيص تعمل على تبسيط العمليات وتعزيز تجارب المستخدم ودفع نمو الأعمال."
        />
      </div>
    </div>
  );
};

export default SecondSection;
