import TitleAndBody from "../ui/TitleAndBody";

const SecondSection = () => {
  return (
    <div className=" mx-10 py-10" style={{ direction: "rtl" }}>
      <div className="text-center">
        <p className=" text-secondary font-semibold font-header text-2xl">
          خدمات تطوير تطبيقات الهاتف المحمول المتطورة لدينا
        </p>
        <p className="text-gray-500  font-body mt-2 text-lg ">
          نساعد رواد الأعمال على تنفيذ أفكارهم الإبداعية وتحويلها إلى تطبيقات
          جوال احترافية لكل من أنظمة أندرويد و ios‼️..
        </p>
      </div>
      <div className="grid grid-flow-row grid-cols-1 md:grid-cols-3 mt-12 gap-y-8 md:gap-y-0">
        <TitleAndBody
          title="تطبيقات المتاجر الإلكترونية مثل Amazon و AliBaba"
          body="هي منصات رقمية تسمح للشركات ببيع منتجاتها أو خدماتها عبر الإنترنت. توفر هذه التطبيقات واجهة افتراضية تمكن العملاء من تصفح واختيار المنتجات بسهولة وإجراء عمليات الشراء بكل يسر وسلاسة من أي مكان وعبر أي جهاز متصل بالإنترنت"
        />
        <TitleAndBody
          title="تطبيق المتجر الإلكتروني متعدد التجار مثل تطبيق Noon"
          body="هو منصة رقمية تسمح للشركات ببيع منتجاتها أو خدماتها عبر الإنترنت. يوفر واجهة متجر افتراضية للعملاء لتصفح واختيار المنتجات بسهولة وشرائها من أي مكان عبر الإنترنت.
          يعمل فريقنا المتخصص من المطورين والمصممين على تقديم حلول تجارة إلكترونية قوية تزيد من المبيعات وتعزز تجارب المستخدم."
        />
        <TitleAndBody
          title="تطبيقات الوساطة التجارية مثل Talabat"
          body="هو عبارة عن منصة متخصصة عبر الإنترنت تسهل المعاملات والتفاعلات بين الشركات (مقدمي الخدمات أو البائعين) والعملاء (المستهلكين أو العملاء) في مختلف الصناعات. يعمل هذا النوع من التطبيقات كوسيط، حيث يربط الشركات التي تقدم خدمات أو منتجات مع العملاء المحتملين الذين يتطلعون إلى الاستفادة من تلك الخدمات أو شراء تلك المنتجات. يعمل فريق الخبراء لدينا من المطورين والمصممين بشكل وثيق مع العملاء لإنشاء حلول قابلة للتخصيص تعمل على تبسيط العمليات وتعزيز تجارب المستخدم ودفع نمو الأعمال."
        />
      </div>
    </div>
  );
};

export default SecondSection;
